Revit 2027 API
ElectricalSystem.NewWires Method
 Create a bunch of wires for the electrical system.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WireSet NewWires(
	View view,
	WiringType wiringType
)
Public Function NewWires (
	view As View,
	wiringType As WiringType
) As WireSet
public:
WireSet^ NewWires(
	View^ view,
	WiringType wiringType
)
member NewWires :
        view : View *
        wiringType : WiringType -> WireSet
Parameters
view View
The view in which the wire is to be visible.
wiringType WiringType
Specify the wiring type (Arc or Chamfer) that is to be applied to all newly created wires.
Return Value
WireSet
New created wires
Exceptions
Exception | Condition
ArgumentException | This method can only be used to create a bunch of wires according to specific pairs of elements, so if there exists a null element in any pair of familyInstancePairs, the exception will be thrown.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace